Tekla.Structures.Plugins.DirectManipulation.Internal.Features.ComponentCreationFeatureBase
The Tekla.Structures.Plugins.DirectManipulation.Internal.Features.ComponentCreationFeatureBase class provides the base class for creating the components.

Tekla.Structures.Plugins.DirectManipulation.Internal.Features.ComponentCreationFeatureBase.#ctor(System.Int32,System.String,System.Boolean)
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Internal.Features.ComponentCreationFeatureBase class.
id: The identifier.
name: The name.
useFeatureContextualToolBar:
The System.Boolean value to indicate whether the feature level contextual toolbar should be used.

Tekla.Structures.Plugins.DirectManipulation.Internal.Features.ComponentCreationFeatureBase.Component
Gets the main component of the feature.

Tekla.Structures.Plugins.DirectManipulation.Internal.Features.ComponentCreationFeatureBase.CommitComponentInput(Tekla.Structures.Model.ComponentInput)
Commits the component input.
input: The input.